 <div class="row">
        <div class="col-lg-9">
            <h1>577.Employee Bonus</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Select all employee&#39;s name and bonus whose bonus is &lt; 1000.</p>

<p>Table:<code>Employee7 </code></p>

<pre>
+-------+--------+-----------+--------+
| empId |  name  | supervisor| salary |
+-------+--------+-----------+--------+
|   1   | John   |  3        | 1000   |
|   2   | Dan    |  3        | 2000   |
|   3   | Brad   |  null     | 4000   |
|   4   | Thomas |  3        | 4000   |
+-------+--------+-----------+--------+
empId is the primary key column for this table.
</pre>

<p>Table: <code>Bonus</code></p>

<pre>
+-------+-------+
| empId | bonus |
+-------+-------+
| 2     | 500   |
| 4     | 2000  |
+-------+-------+
empId is the primary key column for this table.
</pre>

<p>Example ouput:</p>

<pre>
+-------+-------+
| name  | bonus |
+-------+-------+
| John  | null  |
| Dan   | 500   |
| Brad  | null  |
+-------+-------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("Employee7", engine)

   EmpId    Name  Supervisor  Salary
0      3    Brad         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [3]:
pd.read_sql_table("Bonus", engine)

   EmpId  Bonus
0      2    500
1      4   2000

In [8]:
query = '''
SELECT e.name, b.bonus
FROM Employee7 e
LEFT JOIN Bonus b
ON e.empId = b.empId
WHERE IFNULL(b.bonus, 0) < 1000 ;
'''
pd.read_sql_query(query, engine)

   name  bonus
0   Dan  500.0
1  Brad    NaN
2  John    NaN

## Note:
# Time: O(nk)
# Space: O(n)

#### 1. IFNULL([var], [replace value if null])